                    GNU AFFERO GENERAL PUBLIC LICENSE
                       Версия 3, 19 ноября 2007 г.

                   Официальный перевод на русский язык
        Перевод выполнен в образовательных и ознакомительных целях.
    Юридическую силу имеет только оригинальный текст на английском языке.

 Авторское право © 2025 lucky

 Каждому разрешается копировать и распространять дословные копии
 этого лицензионного документа, но изменение его не допускается.


                            ПРЕАМБУЛА

  Стандартная общественная лицензия GNU Affero — это свободная, копилефтная
лицензия на программное обеспечение и другие виды произведений, специально
разработанная для обеспечения сотрудничества с сообществом в случае
программного обеспечения, используемого на сетевых серверах.

  Лицензии на большинство программного обеспечения и других практических
произведений разработаны так, чтобы лишить вас свободы делиться и изменять
произведения. Напротив, наши Стандартные общественные лицензии призваны
гарантировать вашу свободу делиться и изменять все версии программы,
обеспечивая её сохранение в качестве свободного программного обеспечения
для всех пользователей.

  Когда мы говорим о свободном программном обеспечении, мы имеем в виду
свободу, а не цену. Наши Стандартные общественные лицензии разработаны для
обеспечения того, чтобы у вас была свобода распространять копии свободного
программного обеспечения (и взимать за них плату, если вы этого желаете),
чтобы вы получали исходный код или могли получить его при желании, чтобы
вы могли изменять программное обеспечение или использовать его части в
новых свободных программах, и чтобы вы знали, что можете это делать.

  Разработчики, использующие наши Стандартные общественные лицензии,
защищают ваши права двумя шагами: (1) заявляют авторское право на
программное обеспечение и (2) предлагают вам данную Лицензию, которая
даёт вам юридическое разрешение копировать, распространять и/или
модифицировать программное обеспечение.

  Вторичная выгода защиты свободы всех пользователей заключается в том,
что улучшения, сделанные в альтернативных версиях программы, при условии
их широкого использования, становятся доступными для других разработчиков.
Многие разработчики свободного программного обеспечения воодушевлены и
поощрены возникающим в результате сотрудничеством. Однако в случае
программного обеспечения, используемого на сетевых серверах, этот
результат может не достигаться. Стандартная общественная лицензия GNU
разрешает создание модифицированной версии и предоставление публичного
доступа к ней на сервере, не требуя выпуска её исходного кода.

  Стандартная общественная лицензия GNU Affero разработана специально для
того, чтобы в таких случаях модифицированный исходный код становился
доступным сообществу. Она требует, чтобы оператор сетевого сервера
предоставлял исходный код модифицированной версии, работающей на нём,
пользователям этого сервера. Таким образом, публичное использование
модифицированной версии на общедоступном сервере даёт публике доступ
к исходному коду модифицированной версии.

  Более старая лицензия, называемая Общественной лицензией Affero и
опубликованная компанией Affero, была разработана для достижения
аналогичных целей. Это другая лицензия, не являющаяся версией Affero GPL,
но Affero выпустила новую версию Affero GPL, которая разрешает
перелицензирование на условиях данной лицензии.

  Точные условия копирования, распространения и модификации изложены ниже.


                     УСЛОВИЯ И ПОЛОЖЕНИЯ

  0. Определения.

  "Данная Лицензия" означает версию 3 Стандартной общественной лицензии
GNU Affero.

  "Авторское право" также означает законы, аналогичные авторскому праву,
которые применяются к другим видам произведений, таким как полупроводниковые
маски.

  "Программа" означает любое охраняемое авторским правом произведение,
лицензированное на условиях данной Лицензии. Каждый лицензиат обозначается
как "вы". "Лицензиаты" и "получатели" могут быть физическими лицами или
организациями.

  "Модифицировать" произведение означает копировать или адаптировать всё
произведение или его часть способом, требующим получения разрешения
обладателя авторского права, за исключением создания точной копии.
Полученное произведение называется "модифицированной версией" более
раннего произведения или произведением, "основанным на" более раннем
произведении.

  "Охраняемое произведение" означает либо немодифицированную Программу,
либо произведение, основанное на Программе.

  "Распространять" произведение означает совершать с ним любые действия,
которые без наличия разрешения повлекли бы прямую или вторичную
ответственность за нарушение применимого законодательства об авторском
праве, за исключением выполнения на компьютере или модификации частной
копии. Распространение включает копирование, передачу (с модификацией
или без), доведение до всеобщего сведения, а в некоторых странах также
другие виды деятельности.

  "Передавать" произведение означает любой вид распространения,
позволяющий другим сторонам создавать или получать копии. Одно лишь
взаимодействие с пользователем через компьютерную сеть без передачи
копии не является передачей.

  "Интерактивный пользовательский интерфейс" отображает "Соответствующие
юридические уведомления" в той мере, в которой он содержит удобную и
заметную функцию, которая (1) отображает соответствующее уведомление об
авторском праве и (2) сообщает пользователю, что на произведение не
предоставляется гарантия (за исключением случаев, когда гарантии
предоставляются отдельно), что лицензиаты могут передавать произведение
на условиях данной Лицензии, и как ознакомиться с копией данной Лицензии.

  1. Исходный код.

  "Исходный код" произведения означает предпочтительную форму произведения
для внесения в него модификаций. "Объектный код" означает любую неисходную
форму произведения.

  "Стандартный интерфейс" означает интерфейс, который является официальным
стандартом, определённым признанным органом по стандартизации, либо, в
случае интерфейсов, специфичных для определённого языка программирования,
интерфейс, широко используемый разработчиками, работающими на этом языке.

  "Системные библиотеки" исполняемого произведения включают всё, кроме
произведения как целого, что (a) включено в нормальную форму упаковки
Основного Компонента, но не является частью этого Основного Компонента,
и (b) служит только для обеспечения использования произведения с этим
Основным Компонентом или для реализации Стандартного Интерфейса,
реализация которого доступна общественности в форме исходного кода.
"Основной Компонент" в данном контексте означает основной существенный
компонент (ядро, оконную систему и т.д.) конкретной операционной системы
(при наличии), в которой выполняется исполняемое произведение, либо
компилятор, используемый для создания произведения, либо интерпретатор
объектного кода, используемый для его выполнения.

  "Соответствующий исходный код" для произведения в форме объектного
кода означает весь исходный код, необходимый для генерации, установки и
(для исполняемого произведения) выполнения объектного кода и модификации
произведения, включая сценарии для управления этими действиями. Однако в
него не входят Системные библиотеки произведения, или инструменты общего
назначения, или общедоступные свободные программы, используемые
немодифицированными при выполнении этих действий, но не являющиеся частью
произведения. Например, Соответствующий исходный код включает файлы
определений интерфейсов, связанные с исходными файлами произведения, и
исходный код совместно используемых библиотек и динамически компонуемых
подпрограмм, для использования которых произведение специально
предназначено.

  Соответствующий исходный код не должен включать ничего, что пользователи
могут автоматически регенерировать из других частей Соответствующего
исходного кода.

  Соответствующим исходным кодом для произведения в форме исходного кода
является само это произведение.

  2. Основные разрешения.

  Все права, предоставленные на условиях данной Лицензии, предоставляются
на срок действия авторского права на Программу и являются безотзывными
при соблюдении установленных условий. Данная Лицензия явно подтверждает
ваше неограниченное разрешение на выполнение немодифицированной Программы.
Вывод, полученный в результате выполнения охраняемого произведения,
подпадает под действие данной Лицензии только в том случае, если вывод,
с учётом его содержания, представляет собой охраняемое произведение.
Данная Лицензия признаёт ваши права добросовестного использования или
иные эквивалентные права, предусмотренные законодательством об авторском
праве.

  Вы можете создавать, выполнять и распространять охраняемые произведения,
которые вы не передаёте, без каких-либо условий, пока ваша лицензия
остаётся в силе. Вы можете передавать охраняемые произведения другим
лицам с единственной целью выполнения ими модификаций исключительно для
вас или предоставления вам средств для выполнения этих произведений, при
условии соблюдения вами условий данной Лицензии при передаче всех
материалов, авторское право на которые вам не принадлежит. Те, кто таким
образом создаёт или выполняет охраняемые произведения для вас, должны
делать это исключительно от вашего имени, под вашим руководством и
контролем, на условиях, запрещающих им создание копий вашего охраняемого
авторским правом материала вне их отношений с вами.

  Передача при любых других обстоятельствах разрешается исключительно на
условиях, указанных ниже. Сублицензирование не допускается; раздел 10
делает его ненужным.

  3. Защита законных прав пользователей от законодательства
     о запрете обхода технических средств защиты.

  Никакое охраняемое произведение не должно считаться частью эффективного
технического средства защиты в соответствии с любым применимым
законодательством, выполняющим обязательства по статье 11 Договора ВОИС
по авторскому праву, принятого 20 декабря 1996 г., или аналогичными
законами, запрещающими или ограничивающими обход таких средств.

  При передаче охраняемого произведения вы отказываетесь от любых законных
полномочий запрещать обход технических средств защиты в той мере, в какой
такой обход осуществляется путём осуществления прав, предоставленных
данной Лицензией на охраняемое произведение, и вы отказываетесь от любого
намерения ограничить функционирование или модификацию произведения как
средства принудительного применения против пользователей произведения
ваших или третьих лиц законных прав на запрет обхода технических средств
защиты.

  4. Передача дословных копий.

  Вы можете передавать дословные копии исходного кода Программы в том
виде, в котором вы его получили, на любом носителе, при условии, что вы
на каждой копии явно и соответствующим образом опубликуете соответствующее
уведомление об авторском праве; сохраните в неприкосновенности все
уведомления о том, что данная Лицензия и любые неразрешающие условия,
добавленные в соответствии с разделом 7, применяются к коду; сохраните в
неприкосновенности все уведомления об отсутствии какой-либо гарантии; и
предоставите всем получателям копию данной Лицензии вместе с Программой.

  Вы можете взимать любую плату или не взимать никакой платы за каждую
передаваемую вами копию, а также можете предлагать поддержку или
гарантийную защиту за плату.

  5. Передача модифицированных версий исходного кода.

  Вы можете передавать произведение, основанное на Программе, или
модификации для его создания из Программы, в форме исходного кода на
условиях раздела 4, при условии, что вы также соответствуете всем
следующим условиям:

    a) Произведение должно содержать заметные уведомления о том, что вы
    его модифицировали, с указанием соответствующей даты.

    b) Произведение должно содержать заметные уведомления о том, что оно
    выпускается на условиях данной Лицензии и любых условий, добавленных
    в соответствии с разделом 7. Данное требование модифицирует требование
    раздела 4 о "сохранении в неприкосновенности всех уведомлений".

    c) Вы должны лицензировать всё произведение в целом на условиях данной
    Лицензии для всех, кто получает его копию. Таким образом, данная
    Лицензия будет применяться вместе с любыми применимыми дополнительными
    условиями раздела 7 ко всему произведению и всем его частям, независимо
    от способа их упаковки. Данная Лицензия не даёт разрешения на
    лицензирование произведения каким-либо иным способом, но не делает
    недействительным такое разрешение, если вы получили его отдельно.

    d) Если произведение имеет интерактивные пользовательские интерфейсы,
    каждый из них должен отображать Соответствующие юридические уведомления;
    однако, если Программа имеет интерактивные интерфейсы, которые не
    отображают Соответствующие юридические уведомления, ваше произведение
    не обязано этого делать.

  Компиляция охраняемого произведения с другими отдельными и независимыми
произведениями, которые по своей природе не являются расширениями
охраняемого произведения и не объединены с ним таким образом, чтобы
образовывать более крупную программу, на каком-либо томе носителя для
хранения или распространения, называется "агрегатом", если компиляция и
возникающее в результате неё авторское право не используются для
ограничения доступа или законных прав пользователей компиляции за
пределами того, что разрешают отдельные произведения. Включение
охраняемого произведения в агрегат не приводит к применению данной
Лицензии к другим частям агрегата.

  6. Передача в неисходных формах.

  Вы можете передавать охраняемое произведение в форме объектного кода на
условиях разделов 4 и 5, при условии, что вы также передадите
машиночитаемый Соответствующий исходный код на условиях данной Лицензии
одним из следующих способов:

    a) Передать объектный код в физическом продукте (включая физический
    носитель для распространения) или воплощённым в нём, в сопровождении
    Соответствующего исходного кода, зафиксированного на долговечном
    физическом носителе, обычно используемом для обмена программным
    обеспечением.

    b) Передать объектный код в физическом продукте (включая физический
    носитель для распространения) или воплощённым в нём, в сопровождении
    письменного предложения, действительного в течение не менее трёх лет
    и действительного до тех пор, пока вы предлагаете запасные части или
    поддержку клиентов для этой модели продукта, предоставить любому,
    кто владеет объектным кодом, либо (1) копию Соответствующего исходного
    кода для всего программного обеспечения в продукте, на которое
    распространяется данная Лицензия, на долговечном физическом носителе,
    обычно используемом для обмена программным обеспечением, по цене, не
    превышающей ваши разумные затраты на физическое выполнение такой
    передачи исходного кода, либо (2) доступ для копирования
    Соответствующего исходного кода с сетевого сервера бесплатно.

    c) Передавать отдельные копии объектного кода с копией письменного
    предложения о предоставлении Соответствующего исходного кода. Данная
    альтернатива разрешена только эпизодически и некоммерчески и только
    в том случае, если вы получили объектный код с таким предложением в
    соответствии с подразделом 6b.

    d) Передавать объектный код путём предложения доступа из указанного
    места (бесплатно или за плату) и предложения эквивалентного доступа
    к Соответствующему исходному коду таким же способом через то же
    место без дополнительной платы. Вы не обязаны требовать от получателей
    копирования Соответствующего исходного кода вместе с объектным кодом.
    Если местом копирования объектного кода является сетевой сервер,
    Соответствующий исходный код может находиться на другом сервере
    (управляемом вами или третьей стороной), который поддерживает
    эквивалентные средства копирования, при условии, что вы разместите
    рядом с объектным кодом чёткие указания, сообщающие, где найти
    Соответствующий исходный код. Независимо от того, какой сервер
    размещает Соответствующий исходный код, вы обязаны обеспечить его
    доступность в течение времени, необходимого для удовлетворения этих
    требований.

    e) Передавать объектный код с использованием одноранговой передачи
    при условии, что вы проинформируете других участников о том, где
    объектный код и Соответствующий исходный код произведения предлагаются
    широкой общественности бесплатно в соответствии с подразделом 6d.

  Отделимая часть объектного кода, исходный код которой исключён из
Соответствующего исходного кода как Системная библиотека, не обязательно
должна включаться в передачу произведения в форме объектного кода.

  "Пользовательский Продукт" означает либо (1) "потребительский продукт",
то есть любое осязаемое личное имущество, обычно используемое для личных,
семейных или бытовых целей, либо (2) что-либо, разработанное или проданное
для включения в жилище. При определении того, является ли продукт
потребительским продуктом, сомнительные случаи должны разрешаться в пользу
признания продукта потребительским. Для конкретного продукта, полученного
конкретным пользователем, "обычно используемый" означает типичное или
распространённое использование продукта такого класса, независимо от
статуса конкретного пользователя или от того, как конкретный пользователь
фактически использует или предполагает использовать продукт. Продукт
является потребительским продуктом независимо от того, имеет ли продукт
существенное коммерческое, промышленное или непотребительское использование,
если только такое использование не является единственным значимым способом
использования продукта.

  "Информация об установке" для Пользовательского Продукта означает любые
методы, процедуры, ключи авторизации или другую информацию, необходимую
для установки и выполнения модифицированных версий охраняемого произведения
в этом Пользовательском Продукте из модифицированной версии его
Соответствующего исходного кода. Информация должна быть достаточной для
обеспечения того, чтобы продолжение функционирования модифицированного
объектного кода ни в коем случае не было предотвращено или нарушено
исключительно по причине того, что была произведена модификация.

  Если вы передаёте произведение в форме объектного кода в соответствии с
данным разделом в Пользовательском Продукте, или с ним, или специально для
использования в нём, и передача происходит как часть сделки, в которой
право владения и использования Пользовательского Продукта передаётся
получателю навсегда или на фиксированный срок (независимо от того, как
характеризуется сделка), Соответствующий исходный код, переданный в
соответствии с данным разделом, должен сопровождаться Информацией об
установке. Однако это требование не применяется, если ни вы, ни какая-либо
третья сторона не сохраняет возможность установки модифицированного
объектного кода на Пользовательском Продукте (например, произведение
было установлено в ПЗУ).

  Требование предоставить Информацию об установке не включает требование
продолжать предоставлять услуги поддержки, гарантию или обновления для
произведения, которое было модифицировано или установлено получателем,
или для Пользовательского Продукта, в котором оно было модифицировано или
установлено. Доступ к сети может быть запрещён, если сама модификация
существенно и неблагоприятно влияет на работу сети или нарушает правила
и протоколы связи в сети.

  Соответствующий исходный код, переданный, и Информация об установке,
предоставленная в соответствии с данным разделом, должны быть в формате,
который публично документирован (и с реализацией, доступной общественности
в форме исходного кода), и не должны требовать специального пароля или
ключа для распаковки, чтения или копирования.

  7. Дополнительные условия.

  "Дополнительные разрешения" — это условия, которые дополняют условия
данной Лицензии, делая исключения из одного или нескольких её положений.
Дополнительные разрешения, применимые ко всей Программе, должны
рассматриваться так, как если бы они были включены в данную Лицензию, в
той мере, в какой они действительны в соответствии с применимым
законодательством. Если дополнительные разрешения применяются только к
части Программы, эта часть может использоваться отдельно в соответствии
с этими разрешениями, но вся Программа остаётся под действием данной
Лицензии без учёта дополнительных разрешений.

  При передаче копии охраняемого произведения вы можете по своему
усмотрению удалить любые дополнительные разрешения из этой копии или из
любой её части. Вы можете применить дополнительные разрешения к материалу,
добавленному вами в охраняемое произведение, для которого вы имеете или
можете предоставить соответствующее разрешение правообладателя.

  Несмотря на любые другие положения данной Лицензии, в отношении
материала, который вы добавляете в охраняемое произведение, вы можете
(если уполномочены на это правообладателями данного материала) дополнить
условия данной Лицензии условиями:

    a) Отказ от гарантии или ограничение ответственности способом,
    отличным от условий разделов 15 и 16 данной Лицензии; или

    b) Требование сохранения определённых разумных юридических уведомлений
    или указаний авторства в этом материале или в Соответствующих
    юридических уведомлениях, отображаемых в содержащих его произведениях;
    или

    c) Запрет на искажение происхождения этого материала, или требование,
    чтобы модифицированные версии такого материала были разумным образом
    отмечены как отличные от оригинальной версии; или

    d) Ограничение использования в целях рекламы имён лицензиаров или
    авторов материала; или

    e) Отказ от предоставления прав в соответствии с законодательством
    о товарных знаках на использование некоторых торговых наименований,
    товарных знаков или знаков обслуживания; или

    f) Требование возмещения убытков лицензиарам и авторам этого материала
    любым, кто передаёт материал (или его модифицированные версии) с
    договорными обязательствами об ответственности перед получателем,
    за любую ответственность, которую эти договорные обязательства
    непосредственно налагают на этих лицензиаров и авторов.

  Все другие неразрешающие дополнительные условия считаются "дальнейшими
ограничениями" в значении раздела 10. Если полученная вами Программа или
любая её часть содержит уведомление о том, что она регулируется данной
Лицензией вместе с условием, являющимся дальнейшим ограничением, вы можете
удалить это условие. Если лицензионный документ содержит дальнейшее
ограничение, но разрешает перелицензирование или передачу на условиях
данной Лицензии, вы можете добавить в охраняемое произведение материал,
регулируемый условиями такого лицензионного документа, при условии, что
дальнейшее ограничение не сохраняется после такого перелицензирования или
передачи.

  Если вы добавляете условия в охраняемое произведение в соответствии с
данным разделом, вы должны разместить в соответствующих исходных файлах
заявление о дополнительных условиях, применимых к этим файлам, или
уведомление о том, где найти применимые условия.

  Дополнительные условия, разрешающие или неразрешающие, могут быть
изложены в форме отдельно написанной лицензии или в форме исключений;
вышеуказанные требования применяются в любом случае.

  8. Прекращение действия.

  Вы не можете распространять или модифицировать охраняемое произведение
иначе, чем явно предусмотрено данной Лицензией. Любая попытка иным образом
распространить или модифицировать его является недействительной и
автоматически прекращает ваши права по данной Лицензии.

  Однако, если вы прекратите любое нарушение данной Лицензии, ваша лицензия,
полученная от конкретного правообладателя, восстанавливается (a)
предварительно, если и до тех пор, пока правообладатель явно и окончательно
не прекратит действие вашей лицензии, и (b) навсегда, если правообладатель
не уведомит вас о нарушении каким-либо разумным способом в течение 60 дней
после прекращения нарушения.

  Более того, ваша лицензия, полученная от конкретного правообладателя,
восстанавливается навсегда, если правообладатель уведомляет вас о
нарушении каким-либо разумным способом, это первое полученное вами от
этого правообладателя уведомление о нарушении данной Лицензии (в отношении
любого произведения), и вы устраняете нарушение в течение 30 дней после
получения уведомления.

  Прекращение ваших прав в соответствии с данным разделом не прекращает
действия лицензий сторон, получивших копии или права от вас на условиях
данной Лицензии. Если ваши права прекращены и не восстановлены навсегда,
вы не имеете права на получение новых лицензий на тот же материал в
соответствии с разделом 10.

  9. Принятие не требуется для обладания копиями.

  Вы не обязаны принимать данную Лицензию для того, чтобы получить или
выполнить копию Программы. Вспомогательное распространение охраняемого
произведения, происходящее исключительно в результате использования
одноранговой передачи для получения копии, также не требует принятия.
Однако ничто иное, кроме данной Лицензии, не даёт вам разрешения на
распространение или модификацию любого охраняемого произведения. Эти
действия нарушают авторское право, если вы не принимаете данную Лицензию.
Таким образом, модификация или распространение охраняемого произведения
означает ваше согласие с данной Лицензией.

  10. Автоматическое лицензирование последующих получателей.

  Каждый раз, когда вы передаёте охраняемое произведение, получатель
автоматически получает от первоначальных лицензиаров лицензию на
выполнение, модификацию и распространение этого произведения согласно
условиям данной Лицензии. Вы не несёте ответственности за обеспечение
соблюдения данной Лицензии третьими лицами.

  "Сделка с предприятием" — это сделка, связанная с передачей контроля над
организацией или практически всех её активов, или разделением организации,
или слиянием организаций. Если распространение охраняемого произведения
происходит в результате сделки с предприятием, каждая сторона этой сделки,
получающая копию произведения, также получает любые лицензии на
произведение, которые предшественник стороны в интересе имел или мог
предоставить в соответствии с предыдущим параграфом, плюс право на
владение Соответствующим исходным кодом произведения от предшественника в
интересе, если предшественник имеет его или может получить его с разумными
усилиями.

  Вы не можете налагать какие-либо дальнейшие ограничения на осуществление
прав, предоставленных или подтверждённых данной Лицензией. Например, вы не
можете налагать лицензионный сбор, роялти или другую плату за осуществление
прав, предоставленных данной Лицензией, и не можете инициировать судебное
разбирательство (включая встречный иск в судебном процессе), утверждая, что
какое-либо патентное требование нарушается путём создания, использования,
продажи, предложения к продаже или импорта Программы или любой её части.

  11. Патенты.

  "Вноситель" — это правообладатель, который разрешает использование на
условиях данной Лицензии Программы или произведения, на котором Программа
основана. Произведение, лицензированное таким образом, называется "версией
вносителя".

  "Существенные патентные требования" вносителя — это все патентные
требования, принадлежащие или контролируемые вносителем, как уже
приобретённые, так и те, которые будут приобретены в будущем, которые
были бы нарушены каким-либо способом, разрешённым данной Лицензией,
создания, использования или продажи его версии вносителя, но не включают
требования, которые были бы нарушены только как следствие дальнейшей
модификации версии вносителя. Для целей данного определения "контроль"
включает право предоставлять патентные сублицензии способом, совместимым
с требованиями данной Лицензии.

  Каждый вноситель предоставляет вам неисключительную, всемирную,
безвозмездную патентную лицензию на существенные патентные требования
вносителя на создание, использование, продажу, предложение для продажи,
импорт и иное выполнение, модификацию и распространение содержания версии
вносителя.

  В следующих трёх параграфах "патентная лицензия" означает любое явное
соглашение или обязательство, как бы оно ни называлось, не принуждать к
соблюдению патента (такое как явное разрешение на использование патента
или обязательство не предъявлять иск о нарушении патента). "Предоставить"
такую патентную лицензию стороне означает заключить такое соглашение или
обязательство не принуждать к соблюдению патента в отношении этой стороны.

  Если вы передаёте охраняемое произведение, полагаясь на патентную
лицензию, и Соответствующий исходный код произведения недоступен для
копирования кем-либо бесплатно и на условиях данной Лицензии через
общедоступный сетевой сервер или другие легко доступные средства, вы
должны либо (1) обеспечить доступность Соответствующего исходного кода,
либо (2) отказаться от преимущества патентной лицензии для этого
конкретного произведения, либо (3) распространить патентную лицензию на
последующих получателей способом, совместимым с требованиями данной
Лицензии. "Полагаясь на патентную лицензию" означает, что вы осознаёте,
что без патентной лицензии ваша передача охраняемого произведения в
стране или использование охраняемого произведения вашим получателем в
стране нарушило бы один или несколько идентифицируемых патентов в этой
стране, которые, как у вас есть основания полагать, являются
действительными.

  Если в соответствии с или в связи с одной сделкой или соглашением вы
передаёте или распространяете путём обеспечения передачи охраняемое
произведение и предоставляете патентную лицензию некоторым сторонам,
получающим охраняемое произведение, разрешающую им использовать,
распространять, модифицировать или передавать конкретную копию охраняемого
произведения, то предоставляемая вами патентная лицензия автоматически
распространяется на всех получателей охраняемого произведения и основанных
на нём произведений.

  Патентная лицензия является "дискриминационной", если она не включает в
сферу своего действия, запрещает осуществление или ставит условием
неосуществление одного или нескольких прав, специально предоставленных
данной Лицензией. Вы не можете передавать охраняемое произведение, если
вы являетесь стороной соглашения с третьей стороной, занимающейся
распространением программного обеспечения, в соответствии с которым вы
производите оплату третьей стороне в зависимости от объёма вашей
деятельности по передаче произведения, и в соответствии с которым третья
сторона предоставляет любой из сторон, которая получила бы охраняемое
произведение от вас, дискриминационную патентную лицензию (a) в связи с
копиями охраняемого произведения, переданного вами (или копиями,
сделанными с этих копий), или (b) преимущественно для и в связи с
конкретными продуктами или компиляциями, содержащими охраняемое
произведение, если только вы не заключили это соглашение или такая
патентная лицензия не была предоставлена до 28 марта 2007 г.

  Ничто в данной Лицензии не должно толковаться как исключающее или
ограничивающее любую подразумеваемую лицензию или другие средства защиты
от нарушения, которые в противном случае могли бы быть доступны вам в
соответствии с применимым патентным законодательством.

  12. Никакой отказ от свободы других.

  Если на вас налагаются условия (по решению суда, соглашению или иным
образом), противоречащие условиям данной Лицензии, они не освобождают вас
от выполнения условий данной Лицензии. Если вы не можете передавать
охраняемое произведение так, чтобы одновременно удовлетворить ваши
обязательства по данной Лицензии и любые другие соответствующие
обязательства, то, как следствие, вы не можете передавать его вообще.
Например, если вы соглашаетесь на условия, обязывающие вас взимать
роялти за дальнейшую передачу с тех, кому вы передаёте Программу, то
единственным способом удовлетворить как эти условия, так и данную
Лицензию было бы полное воздержание от передачи Программы.

  13. Удалённое сетевое взаимодействие; Использование со Стандартной
      общественной лицензией GNU.

  Несмотря на любые другие положения данной Лицензии, если вы
модифицируете Программу, ваша модифицированная версия должна явно
предлагать всем пользователям, взаимодействующим с ней удалённо через
компьютерную сеть (если ваша версия поддерживает такое взаимодействие),
возможность получения Соответствующего исходного кода вашей версии путём
предоставления доступа к Соответствующему исходному коду с сетевого
сервера бесплатно через некоторые стандартные или обычные средства
облегчения копирования программного обеспечения. Этот Соответствующий
исходный код должен включать Соответствующий исходный код для любого
произведения, подпадающего под действие версии 3 Стандартной общественной
лицензии GNU, включённого в соответствии со следующим параграфом.

  Несмотря на любые другие положения данной Лицензии, вы имеете разрешение
связывать или комбинировать любое охраняемое произведение с произведением,
лицензированным под версией 3 Стандартной общественной лицензии GNU, в
единое комбинированное произведение и передавать полученное произведение.
Условия данной Лицензии будут продолжать применяться к части, являющейся
охраняемым произведением, но произведение, с которым оно объединено,
останется регулируемым версией 3 Стандартной общественной лицензии GNU.

  14. Пересмотренные версии данной Лицензии.

  Фонд свободного программного обеспечения может время от времени
публиковать пересмотренные и/или новые версии Стандартной общественной
лицензии GNU Affero. Такие новые версии будут аналогичны по духу настоящей
версии, но могут отличаться в деталях, направленных на решение новых
проблем или новых вопросов.

  Каждой версии присваивается отличительный номер версии. Если в Программе
указано, что к ней применяется определённая нумерованная версия
Стандартной общественной лицензии GNU Affero "или любая более поздняя
версия", вы имеете возможность следовать условиям либо этой нумерованной
версии, либо любой более поздней версии, опубликованной Фондом свободного
программного обеспечения. Если Программа не указывает номер версии
Стандартной общественной лицензии GNU Affero, вы можете выбрать любую
версию, когда-либо опубликованную Фондом свободного программного
обеспечения.

  Если в Программе указано, что доверенное лицо может решать, какие
будущие версии Стандартной общественной лицензии GNU Affero могут быть
использованы, публичное заявление этого доверенного лица о принятии версии
навсегда даёт вам право выбрать эту версию для Программы.

  Более поздние версии лицензии могут предоставлять вам дополнительные
или иные разрешения. Однако никакие дополнительные обязательства не
налагаются на любого автора или правообладателя в результате вашего
выбора следовать более поздней версии.

  15. Отказ от гарантий.

  НА ПРОГРАММУ НЕ ПРЕДОСТАВЛЯЕТСЯ НИКАКИХ ГАРАНТИЙ В ТОЙ МЕРЕ, В КАКОЙ
ЭТО ДОПУСКАЕТСЯ ПРИМЕНИМЫМ ЗАКОНОДАТЕЛЬСТВОМ. ЕСЛИ ИНОЕ НЕ УКАЗАНО В
ПИСЬМЕННОЙ ФОРМЕ, ПРАВООБЛАДАТЕЛИ И/ИЛИ ДРУГИЕ СТОРОНЫ ПРЕДОСТАВЛЯЮТ
ПРОГРАММУ "КАК ЕСТЬ" БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, КАК ЯВНЫХ, ТАК И
ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ
ТОВАРНОГО СОСТОЯНИЯ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ. ВЕСЬ РИСК В
ОТНОШЕНИИ КАЧЕСТВА И ПРОИЗВОДИТЕЛЬНОСТИ ПРОГРАММЫ ЛЕЖИТ НА ВАС. ЕСЛИ
ПРОГРАММА ОКАЖЕТСЯ ДЕФЕКТНОЙ, ВЫ ПРИНИМАЕТЕ НА СЕБЯ СТОИМОСТЬ ВСЕГО
НЕОБХОДИМОГО ОБСЛУЖИВАНИЯ, РЕМОНТА ИЛИ ИСПРАВЛЕНИЯ.

  16. Ограничение ответственности.

  НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ, ЕСЛИ ТОЛЬКО НЕ ТРЕБУЕТСЯ ПРИМЕНИМЫМ
ЗАКОНОДАТЕЛЬСТВОМ ИЛИ НЕ ОГОВОРЕНО В ПИСЬМЕННОЙ ФОРМЕ, НИ ОДИН
ПРАВООБЛАДАТЕЛЬ И НИ ОДНА ДРУГАЯ СТОРОНА, КОТОРАЯ МОДИФИЦИРУЕТ И/ИЛИ
ПЕРЕДАЁТ ПРОГРАММУ, КАК РАЗРЕШЕНО ВЫШЕ, НЕ НЕСЁТ ОТВЕТСТВЕННОСТИ ПЕРЕД
ВАМИ ЗА УБЫТКИ, ВКЛЮЧАЯ ЛЮБЫЕ ОБЩИЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ ИЛИ
КОСВЕННЫЕ УБЫТКИ, ВОЗНИКАЮЩИЕ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ИЛИ НЕВОЗМОЖНОСТИ
ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОТЕРЮ ДАННЫХ, ИЛИ
НЕПРАВИЛЬНОСТЬ ДАННЫХ, ИЛИ ПОТЕРИ, ПОНЕСЁННЫЕ ВАМИ ИЛИ ТРЕТЬИМИ ЛИЦАМИ,
ИЛИ НЕВОЗМОЖНОСТЬ ПРОГРАММЫ РАБОТАТЬ СОВМЕСТНО С ДРУГИМИ ПРОГРАММАМИ),
ДАЖЕ ЕСЛИ ТАКОЙ ПРАВООБЛАДАТЕЛЬ ИЛИ ДРУГАЯ СТОРОНА БЫЛИ УВЕДОМЛЕНЫ О
ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ.

  17. Толкование разделов 15 и 16.

  Если отказ от гарантии и ограничение ответственности, приведённые выше,
не могут получить местную юридическую силу в соответствии с их условиями,
рассматривающие суды должны применять местное законодательство, которое
наиболее близко соответствует абсолютному отказу от любой гражданской
ответственности в связи с Программой, если только гарантия или принятие
ответственности не сопровождают копию Программы за плату.

                     КОНЕЦ УСЛОВИЙ И ПОЛОЖЕНИЙ


           Как применить эти условия к вашим новым программам

  Если вы разрабатываете новую программу и хотите, чтобы она принесла
максимальную пользу обществу, лучший способ достичь этого — сделать её
свободным программным обеспечением, которое каждый может распространять
и изменять на данных условиях.

  Для этого приложите к программе следующие уведомления. Наиболее
эффективно разместить их в начале каждого файла исходного кода, чтобы
явно заявить об отсутствии гарантий; каждый файл должен содержать как
минимум строку с указанием авторского права и указание на место, где
можно ознакомиться с полным текстом уведомления.

    TON Tunnel — Android VPN и Windows Desktop клиент на базе TON ADNL
    Авторское право © 2025 lucky

    Эта программа является свободным программным обеспечением: вы можете
    распространять и/или модифицировать её на условиях Стандартной
    общественной лицензии GNU Affero, опубликованной Фондом свободного
    программного обеспечения, либо версии 3 Лицензии, либо (по вашему
    выбору) любой более поздней версии.

    Эта программа распространяется в надежде, что она будет полезной,
    но БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ; даже без подразумеваемых гарантий
    ТОВАРНОГО СОСТОЯНИЯ или ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ.
    Подробнее см. в Стандартной общественной лицензии GNU Affero.

    Вы должны были получить копию Стандартной общественной лицензии
    GNU Affero вместе с этой программой. Если это не так, смотрите
    <https://www.gnu.org/licenses/>.

  Также добавьте информацию о том, как связаться с вами по электронной
и обычной почте.

  Если ваша программа может взаимодействовать с пользователями удалённо
через компьютерную сеть, вы также должны убедиться, что она предоставляет
пользователям способ получить её исходный код. Например, если ваша
программа является веб-приложением, её интерфейс может отображать ссылку
"Исходный код", которая ведёт пользователей к архиву с кодом. Существует
множество способов предложить исходный код, и различные решения будут
лучше подходить для разных программ; см. раздел 13 для ознакомления с
конкретными требованиями.

  Вам также следует попросить вашего работодателя (если вы работаете в
качестве программиста) или учебное заведение, если таковое имеется,
подписать "отказ от авторских прав" на программу, если это необходимо.
Для получения дополнительной информации по этому вопросу, а также о том,
как применять и соблюдать GNU AGPL, см.
<https://www.gnu.org/licenses/>.
